[custom_hooks.py] ✅ custom_hooks.py loaded

📋 Model Summary for Conv1Linear1
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 256, 160, 160]           590,080
ReLU-2                              [2, 256, 160, 160]                 0
Conv2d-3                            [2, 4, 160, 160]               1,028
--------------------------------------------------------------------------------
Total params:         591,108
Trainable params:     591,108
Non-trainable params: 0
--------------------------------------------------------------------------------

📋 Model Summary for DeepLabV3Plus
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 256, 160, 160]            65,536
BatchNorm2d-2                       [2, 256, 160, 160]               512
ReLU-3                              [2, 256, 160, 160]                 0
Conv2d-4                            [2, 256, 160, 160]           589,824
BatchNorm2d-5                       [2, 256, 160, 160]               512
ReLU-6                              [2, 256, 160, 160]                 0
Conv2d-7                            [2, 256, 160, 160]           589,824
BatchNorm2d-8                       [2, 256, 160, 160]               512
ReLU-9                              [2, 256, 160, 160]                 0
Conv2d-10                           [2, 256, 160, 160]           589,824
BatchNorm2d-11                      [2, 256, 160, 160]               512
ReLU-12                             [2, 256, 160, 160]                 0
AdaptiveAvgPool2d-13                [2, 256, 1, 1]                     0
Conv2d-14                           [2, 256, 1, 1]                65,536
BatchNorm2d-15                      [2, 256, 1, 1]                   512
ReLU-16                             [2, 256, 1, 1]                     0
Conv2d-17                           [2, 256, 160, 160]           327,680
BatchNorm2d-18                      [2, 256, 160, 160]               512
ReLU-19                             [2, 256, 160, 160]                 0
Dropout2d-20                        [2, 256, 160, 160]                 0
ASPP-21                             [2, 256, 160, 160]         2,231,296
Conv2d-22                           [2, 256, 160, 160]           589,824
BatchNorm2d-23                      [2, 256, 160, 160]               512
ReLU-24                             [2, 256, 160, 160]                 0
Dropout2d-25                        [2, 256, 160, 160]                 0
Conv2d-26                           [2, 4, 160, 160]               1,028
--------------------------------------------------------------------------------
Total params:         2,822,660
Trainable params:     2,822,660
Non-trainable params: 0
--------------------------------------------------------------------------------

📋 Model Summary for FPN1
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 64, 160, 160]             16,448
Conv2d-2                            [2, 64, 160, 160]             36,864
BatchNorm2d-3                       [2, 64, 160, 160]                128
ReLU-4                              [2, 64, 160, 160]                  0
Conv2d-5                            [2, 4, 160, 160]                 260
--------------------------------------------------------------------------------
Total params:         53,700
Trainable params:     53,700
Non-trainable params: 0
--------------------------------------------------------------------------------

📋 Model Summary for FPN2
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 64, 160, 160]             16,448
MaxPool2d-2                         [2, 256, 80, 80]                   0
Conv2d-3                            [2, 64, 80, 80]               16,448
Upsample-4                          [2, 64, 160, 160]                  0
Conv2d-5                            [2, 64, 160, 160]             73,728
BatchNorm2d-6                       [2, 64, 160, 160]                128
ReLU-7                              [2, 64, 160, 160]                  0
Conv2d-8                            [2, 4, 160, 160]                 260
--------------------------------------------------------------------------------
Total params:         107,012
Trainable params:     107,012
Non-trainable params: 0
--------------------------------------------------------------------------------

📋 Model Summary for UNet2Down1Up
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 64, 80, 80]              802,816
BatchNorm2d-2                       [2, 64, 80, 80]                  128
ReLU-3                              [2, 64, 80, 80]                    0
Conv2d-4                            [2, 64, 80, 80]               36,864
BatchNorm2d-5                       [2, 64, 80, 80]                  128
ReLU-6                              [2, 64, 80, 80]                    0
Conv2d-7                            [2, 64, 80, 80]               36,864
BatchNorm2d-8                       [2, 64, 80, 80]                  128
ReLU-9                              [2, 64, 80, 80]                    0
BasicBlock-10                       [2, 64, 80, 80]               73,984
Conv2d-11                           [2, 64, 80, 80]               36,864
BatchNorm2d-12                      [2, 64, 80, 80]                  128
ReLU-13                             [2, 64, 80, 80]                    0
Conv2d-14                           [2, 64, 80, 80]               36,864
BatchNorm2d-15                      [2, 64, 80, 80]                  128
ReLU-16                             [2, 64, 80, 80]                    0
BasicBlock-17                       [2, 64, 80, 80]               73,984
Conv2d-18                           [2, 128, 40, 40]              73,728
BatchNorm2d-19                      [2, 128, 40, 40]                 256
ReLU-20                             [2, 128, 40, 40]                   0
Conv2d-21                           [2, 128, 40, 40]             147,456
BatchNorm2d-22                      [2, 128, 40, 40]                 256
Conv2d-23                           [2, 128, 40, 40]               8,192
BatchNorm2d-24                      [2, 128, 40, 40]                 256
ReLU-25                             [2, 128, 40, 40]                   0
BasicBlock-26                       [2, 128, 40, 40]             230,144
Conv2d-27                           [2, 128, 40, 40]             147,456
BatchNorm2d-28                      [2, 128, 40, 40]                 256
ReLU-29                             [2, 128, 40, 40]                   0
Conv2d-30                           [2, 128, 40, 40]             147,456
BatchNorm2d-31                      [2, 128, 40, 40]                 256
ReLU-32                             [2, 128, 40, 40]                   0
BasicBlock-33                       [2, 128, 40, 40]             295,424
Upsample-34                         [2, 128, 80, 80]                   0
Conv2d-35                           [2, 64, 80, 80]              110,592
BatchNorm2d-36                      [2, 64, 80, 80]                  128
ReLU-37                             [2, 64, 80, 80]                    0
Conv2d-38                           [2, 64, 80, 80]               36,864
BatchNorm2d-39                      [2, 64, 80, 80]                  128
ReLU-40                             [2, 64, 80, 80]                    0
Up-41                               [2, 64, 80, 80]              147,712
Conv2d-42                           [2, 4, 80, 80]                   260
Upsample-43                         [2, 4, 160, 160]                   0
--------------------------------------------------------------------------------
Total params:         1,624,452
Trainable params:     1,624,452
Non-trainable params: 0
--------------------------------------------------------------------------------

📋 Model Summary for UNet3Down2Up
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 64, 80, 80]              802,816
BatchNorm2d-2                       [2, 64, 80, 80]                  128
ReLU-3                              [2, 64, 80, 80]                    0
Conv2d-4                            [2, 64, 80, 80]               36,864
BatchNorm2d-5                       [2, 64, 80, 80]                  128
ReLU-6                              [2, 64, 80, 80]                    0
Conv2d-7                            [2, 64, 80, 80]               36,864
BatchNorm2d-8                       [2, 64, 80, 80]                  128
ReLU-9                              [2, 64, 80, 80]                    0
BasicBlock-10                       [2, 64, 80, 80]               73,984
Conv2d-11                           [2, 64, 80, 80]               36,864
BatchNorm2d-12                      [2, 64, 80, 80]                  128
ReLU-13                             [2, 64, 80, 80]                    0
Conv2d-14                           [2, 64, 80, 80]               36,864
BatchNorm2d-15                      [2, 64, 80, 80]                  128
ReLU-16                             [2, 64, 80, 80]                    0
BasicBlock-17                       [2, 64, 80, 80]               73,984
Conv2d-18                           [2, 128, 40, 40]              73,728
BatchNorm2d-19                      [2, 128, 40, 40]                 256
ReLU-20                             [2, 128, 40, 40]                   0
Conv2d-21                           [2, 128, 40, 40]             147,456
BatchNorm2d-22                      [2, 128, 40, 40]                 256
Conv2d-23                           [2, 128, 40, 40]               8,192
BatchNorm2d-24                      [2, 128, 40, 40]                 256
ReLU-25                             [2, 128, 40, 40]                   0
BasicBlock-26                       [2, 128, 40, 40]             230,144
Conv2d-27                           [2, 128, 40, 40]             147,456
BatchNorm2d-28                      [2, 128, 40, 40]                 256
ReLU-29                             [2, 128, 40, 40]                   0
Conv2d-30                           [2, 128, 40, 40]             147,456
BatchNorm2d-31                      [2, 128, 40, 40]                 256
ReLU-32                             [2, 128, 40, 40]                   0
BasicBlock-33                       [2, 128, 40, 40]             295,424
Conv2d-34                           [2, 256, 20, 20]             294,912
BatchNorm2d-35                      [2, 256, 20, 20]                 512
ReLU-36                             [2, 256, 20, 20]                   0
Conv2d-37                           [2, 256, 20, 20]             589,824
BatchNorm2d-38                      [2, 256, 20, 20]                 512
Conv2d-39                           [2, 256, 20, 20]              32,768
BatchNorm2d-40                      [2, 256, 20, 20]                 512
ReLU-41                             [2, 256, 20, 20]                   0
BasicBlock-42                       [2, 256, 20, 20]             919,040
Conv2d-43                           [2, 256, 20, 20]             589,824
BatchNorm2d-44                      [2, 256, 20, 20]                 512
ReLU-45                             [2, 256, 20, 20]                   0
Conv2d-46                           [2, 256, 20, 20]             589,824
BatchNorm2d-47                      [2, 256, 20, 20]                 512
ReLU-48                             [2, 256, 20, 20]                   0
BasicBlock-49                       [2, 256, 20, 20]           1,180,672
Upsample-50                         [2, 256, 80, 80]                   0
Conv2d-51                           [2, 256, 80, 80]             737,280
BatchNorm2d-52                      [2, 256, 80, 80]                 512
ReLU-53                             [2, 256, 80, 80]                   0
Conv2d-54                           [2, 256, 80, 80]             589,824
BatchNorm2d-55                      [2, 256, 80, 80]                 512
ReLU-56                             [2, 256, 80, 80]                   0
Up-57                               [2, 256, 80, 80]           1,328,128
Upsample-58                         [2, 256, 160, 160]                 0
Conv2d-59                           [2, 128, 160, 160]           294,912
BatchNorm2d-60                      [2, 128, 160, 160]               256
ReLU-61                             [2, 128, 160, 160]                 0
Conv2d-62                           [2, 4, 160, 160]                 516
--------------------------------------------------------------------------------
Total params:         5,200,004
Trainable params:     5,200,004
Non-trainable params: 0
--------------------------------------------------------------------------------

📋 Model Summary for UNet4Down3Up
--------------------------------------------------------------------------------
Layer (type)                        Output Shape                 Param #
--------------------------------------------------------------------------------
Conv2d-1                            [2, 64, 80, 80]              802,816
BatchNorm2d-2                       [2, 64, 80, 80]                  128
ReLU-3                              [2, 64, 80, 80]                    0
Conv2d-4                            [2, 64, 80, 80]               36,864
BatchNorm2d-5                       [2, 64, 80, 80]                  128
ReLU-6                              [2, 64, 80, 80]                    0
Conv2d-7                            [2, 64, 80, 80]               36,864
BatchNorm2d-8                       [2, 64, 80, 80]                  128
ReLU-9                              [2, 64, 80, 80]                    0
BasicBlock-10                       [2, 64, 80, 80]               73,984
Conv2d-11                           [2, 64, 80, 80]               36,864
BatchNorm2d-12                      [2, 64, 80, 80]                  128
ReLU-13                             [2, 64, 80, 80]                    0
Conv2d-14                           [2, 64, 80, 80]               36,864
BatchNorm2d-15                      [2, 64, 80, 80]                  128
ReLU-16                             [2, 64, 80, 80]                    0
BasicBlock-17                       [2, 64, 80, 80]               73,984
Conv2d-18                           [2, 128, 40, 40]              73,728
BatchNorm2d-19                      [2, 128, 40, 40]                 256
ReLU-20                             [2, 128, 40, 40]                   0
Conv2d-21                           [2, 128, 40, 40]             147,456
BatchNorm2d-22                      [2, 128, 40, 40]                 256
Conv2d-23                           [2, 128, 40, 40]               8,192
BatchNorm2d-24                      [2, 128, 40, 40]                 256
ReLU-25                             [2, 128, 40, 40]                   0
BasicBlock-26                       [2, 128, 40, 40]             230,144
Conv2d-27                           [2, 128, 40, 40]             147,456
BatchNorm2d-28                      [2, 128, 40, 40]                 256
ReLU-29                             [2, 128, 40, 40]                   0
Conv2d-30                           [2, 128, 40, 40]             147,456
BatchNorm2d-31                      [2, 128, 40, 40]                 256
ReLU-32                             [2, 128, 40, 40]                   0
BasicBlock-33                       [2, 128, 40, 40]             295,424
Conv2d-34                           [2, 256, 20, 20]             294,912
BatchNorm2d-35                      [2, 256, 20, 20]                 512
ReLU-36                             [2, 256, 20, 20]                   0
Conv2d-37                           [2, 256, 20, 20]             589,824
BatchNorm2d-38                      [2, 256, 20, 20]                 512
Conv2d-39                           [2, 256, 20, 20]              32,768
BatchNorm2d-40                      [2, 256, 20, 20]                 512
ReLU-41                             [2, 256, 20, 20]                   0
BasicBlock-42                       [2, 256, 20, 20]             919,040
Conv2d-43                           [2, 256, 20, 20]             589,824
BatchNorm2d-44                      [2, 256, 20, 20]                 512
ReLU-45                             [2, 256, 20, 20]                   0
Conv2d-46                           [2, 256, 20, 20]             589,824
BatchNorm2d-47                      [2, 256, 20, 20]                 512
ReLU-48                             [2, 256, 20, 20]                   0
BasicBlock-49                       [2, 256, 20, 20]           1,180,672
Conv2d-50                           [2, 512, 10, 10]           1,179,648
BatchNorm2d-51                      [2, 512, 10, 10]               1,024
ReLU-52                             [2, 512, 10, 10]                   0
Conv2d-53                           [2, 512, 10, 10]           2,359,296
BatchNorm2d-54                      [2, 512, 10, 10]               1,024
Conv2d-55                           [2, 512, 10, 10]             131,072
BatchNorm2d-56                      [2, 512, 10, 10]               1,024
ReLU-57                             [2, 512, 10, 10]                   0
BasicBlock-58                       [2, 512, 10, 10]           3,673,088
Conv2d-59                           [2, 512, 10, 10]           2,359,296
BatchNorm2d-60                      [2, 512, 10, 10]               1,024
ReLU-61                             [2, 512, 10, 10]                   0
Conv2d-62                           [2, 512, 10, 10]           2,359,296
BatchNorm2d-63                      [2, 512, 10, 10]               1,024
ReLU-64                             [2, 512, 10, 10]                   0
BasicBlock-65                       [2, 512, 10, 10]           4,720,640
Conv2d-66                           [2, 256, 20, 20]           1,769,472
BatchNorm2d-67                      [2, 256, 20, 20]                 512
ReLU-68                             [2, 256, 20, 20]                   0
Conv2d-69                           [2, 256, 20, 20]             589,824
BatchNorm2d-70                      [2, 256, 20, 20]                 512
ReLU-71                             [2, 256, 20, 20]                   0
Up-72                               [2, 256, 20, 20]           2,360,320
Conv2d-73                           [2, 128, 40, 40]             442,368
BatchNorm2d-74                      [2, 128, 40, 40]                 256
ReLU-75                             [2, 128, 40, 40]                   0
Conv2d-76                           [2, 128, 40, 40]             147,456
BatchNorm2d-77                      [2, 128, 40, 40]                 256
ReLU-78                             [2, 128, 40, 40]                   0
Up-79                               [2, 128, 40, 40]             590,336
Conv2d-80                           [2, 64, 80, 80]              110,592
BatchNorm2d-81                      [2, 64, 80, 80]                  128
ReLU-82                             [2, 64, 80, 80]                    0
Conv2d-83                           [2, 64, 80, 80]               36,864
BatchNorm2d-84                      [2, 64, 80, 80]                  128
ReLU-85                             [2, 64, 80, 80]                    0
Up-86                               [2, 64, 80, 80]              147,712
Conv2d-87                           [2, 4, 80, 80]                   260
Upsample-88                         [2, 4, 160, 160]                   0
--------------------------------------------------------------------------------
Total params:         15,068,548
Trainable params:     15,068,548
Non-trainable params: 0
--------------------------------------------------------------------------------

📊 Parameter Count Summary (sorted by trainable params):
------------------------------------------------------------
Decoder                         Trainable    Non-trainable
------------------------------------------------------------
UNet4Down3Up                        15.07 M             0.00 M
UNet3Down2Up                         5.20 M             0.00 M
DeepLabV3Plus                        2.82 M             0.00 M
UNet2Down1Up                         1.62 M             0.00 M
Conv1Linear1                         0.59 M             0.00 M
FPN2                                 0.11 M             0.00 M
FPN1                                 0.05 M             0.00 M
------------------------------------------------------------

📸 Plot saved to: model_eval/semantic_decoder_model_size.png
